In [31]:
import pandas as pd
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
#Dropping those columns who have no impact on survival
df.drop(['Ticket','PassengerId','Cabin','Embarked','SibSp','Parch','Name'], axis = 1, inplace = True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [33]:
#Setting the target variable and input for training classification algorithm
target_var = df['Survived']
input_vars = df[['Sex','Age','Pclass','Fare']]
print(target_var.head())
input_vars.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

      Sex   Age  Pclass     Fare
0    male  22.0       3   7.2500
1  female  38.0       1  71.2833
2  female  26.0       3   7.9250
3  female  35.0       1  53.1000
4    male  35.0       3   8.0500

In [34]:
#Converting all input columns to numbers and setting NA values
sex = pd.get_dummies(input_vars['Sex'])
input_vars.drop(['Sex'], axis = 1, inplace = True)

C:\Users\WAQAR\anaconda3\lib\site-packages\pandas\core\frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [39]:
input_vars.head()
final_input = pd.concat([sex,input_vars], axis = 1)
final_input.head()

   female  male   Age  Pclass     Fare
0       0     1  22.0       3   7.2500
1       1     0  38.0       1  71.2833
2       1     0  26.0       3   7.9250
3       1     0  35.0       1  53.1000
4       0     1  35.0       3   8.0500

In [47]:
#Checking for NaN values and filling them
print(final_input.isnull().values.any())
print(final_input.isnull().sum())

#As age contains 177 NAN values so replacing them by means

final_input.Age.fillna(final_input.Age.mean(), inplace = True)

True
female      0
male        0
Age       177
Pclass      0
Fare        0
dtype: int64

In [48]:
#FInal check
final_input.isnull().values.any()

False

In [57]:
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB
from sklearn.metrics import accuracy_score

In [58]:
#Now splitting the dataset into 80 % for training and 20 % for testing
X_train, X_test, y_train, y_test = train_test_split(final_input, target_var, test_size=0.2, random_state=0)

In [59]:
#fitting naive baise model and 
model = GaussianNB()
model.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [60]:
#Checking its predictions and model accuracy
prediction = model.predict(X_test)
print(prediction)

[0 0 0 1 1 0 1 1 0 1 0 1 0 1 1 1 0 0 0 0 0 1 0 0 1 1 0 1 1 1 0 1 0 0 0 0 0
 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 1 1 0 1 0 1 0 1 1 1 0 0 0
 0 1 1 0 0 0 0 0 1 0 0 1 1 1 1 1 0 0 0 1 1 0 1 0 0 0 0 0 0 0 1 1 1 1 0 1 0
 1 0 1 1 1 1 1 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0 0 1 0 0 0 1 0 1 1 1 0 1
 1 0 0 1 1 0 1 0 1 0 1 1 0 0 1 1 0 0 0 0 0 0 0 1 0 0 1 0 1 0 0]

In [62]:
#Checking accuracy of our model
accuracy_score(y_test,prediction)

0.7821229050279329

In [88]:
#Now doing some predictions on unknown dataset i.e. test.csv and look at model accuracy
td_frame = pd.read_csv('test.csv')
td_frame.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [89]:
#First we have to do some pre-processing
td_frame.drop(['Ticket','PassengerId','Cabin','Embarked','SibSp','Parch','Name'], axis = 1, inplace = True)
td_frame.head()

   Pclass     Sex   Age     Fare
0       3    male  34.5   7.8292
1       3  female  47.0   7.0000
2       2    male  62.0   9.6875
3       3    male  27.0   8.6625
4       3  female  22.0  12.2875

In [90]:
dumies = pd.get_dummies(td_frame.Sex)
print(dumies.head())
td_frame.drop(['Sex'], axis = 1, inplace = True)

   female  male
0       0     1
1       1     0
2       0     1
3       0     1
4       1     0

In [93]:
final_test_set = pd.concat([td_frame,dumies], axis = 1)

In [94]:
final_test_set.head()

   Pclass   Age     Fare  female  male
0       3  34.5   7.8292       0     1
1       3  47.0   7.0000       1     0
2       2  62.0   9.6875       0     1
3       3  27.0   8.6625       0     1
4       3  22.0  12.2875       1     0

In [100]:
#Checking data for nan values
final_test_set.isnull().sum()

Pclass     0
Age       86
Fare       1
female     0
male       0
dtype: int64

In [102]:
#Filling nan values

final_test_set.Age.fillna(final_test_set.Age.mean(), inplace = True)
final_test_set.Fare.fillna(final_test_set.Fare.mean(), inplace = True)

In [115]:
#Now doing predictions using our model
predictions= model.predict(final_test_set)

In [116]:
#Checking accuracy of model
gs = pd.read_csv('gender_submission.csv')
gs.head()
accuracy_score(gs.Survived, predictions)

0.36363636363636365

In [117]:
#it means our model is very low on accuracy and we need to undersatnd our data.